{"pageProps":{"experience":[{"title":"Software Engineer","subtitle":"SquareTrade, Inc.","subtitleLink":"https://www.squaretrade.com/","details":["Worked within a globally distributed scrum team to streamline the co-branding process by using a combination of Strategy and Factory pattern to make the code scalable and to brand new merchants with no extra code changes.","Successfully architected and implemented a comprehensive multilingual system, increasing global accessibility and usability for users across Asia, Europe, and LATAM, while supporting various international date/time formats.","Mentored and helped promote Junior Engineers. Provided guidance in TypeScript and Angular, covering advanced concepts such as RxJS, Dependency Injection, Unit Testing, Modules etc.","Acted as a liaison between the design and engineering teams to set realistic design expectations for both sides."],"location":"Tampa, FL (Remote)","duration":"Feb 2022 - Present"},{"title":"Fullstack Software Engineer","subtitle":"GreenLight IoT","subtitleLink":"https://www.greenlightiot.com/","details":["Single-handedly orchestrated the design and end-to-end implementation of IOT building management dashboard, utilizing Angular, NgRX, Nestjs, MongoDB, Google Maps API and external geolocation API for address verification.","Optimized app performance by 90% via Angular router guards and improved data fetching efficiency using NgRx.","Revamped the codebase responsible for displaying IOT devices on HTML canvas by utilizing decorator and strategy patterns, simplifying the process for adding new device variants, mouse interactions, and animations.","Lead code reviews, and established and enforced standardized coding practices, including adopting the AirBnb Style guide, leveraging Prettier and ESLint. Introduced Figma into the SDLC, promoting a design-first approach.","Demonstrated expertise in RXJS, NGRX, Nestjs, and UI design, emerging as the go-to resource in the team."],"location":"Tampa, FL (Remote)","duration":"Sep 2020 - Feb 2022"}]},"__N_SSG":true}